# 11.1. Список (list) - це впорядкована послідовність із деяких значень будь0яких типів: числа, рядки, списки тощо.

# Приклад списків
empty_list = []
animals = ['cat', 'dog', 'fox', 'wolf']
nums = [10, 10, 9, 12, 10]
anything = ['cat', 12, '12']

# Створіть приклад списку, де будуть присутні усі типи даних, в тому числі списки (із вмістом якихось даних та пустий список)

# Копіювання списків:
# - *.copy()
# - list(*)
# - розділенням списку за допомогою *[:],
# де * - це ім'я списку, який необхідно скопіювати

# Скопіюйте список a у нові списки трьома відомими способами та виведіть їх у консоль
a = [1, 2, 3]

# 11.2. Звернення до окремого елемента
color_model = ['red', 'green', 'blue']
# print(color_model[n]) - де n - порядковий номер елемента, до якого ми хочемо звернутись

weekdays = ["Понеділок", "Вівторок", "Середа", "Четвер", "П'ятниця"]
# Виведіть у консоль П'ятницю