# 11.3. Дії над списками. Продовження

# 5. Зміна певного елементу списку
a = ['a', 'b', 'c', 'd']
#a[2] = 'f'
#print(a)

# Додавання нового елементу в кінець списку
a = ['a', 'b', 'c', 'd']
#a.append('f')
#print(a)

# Вставлення елементу в певну позицію списку
a = ['a', 'c', 'd']
#a.insert(1, 'b')
#print(a)

# Видалення елементу зі списку за індексом
a = ['a', 'b', 'c', 'd']
#del a[0]
#print(a)

# Видалення певного елементу зі списку
a = ['a', 'b', 'c', 'd']
#a.remove('b')
#print(a)

# 1.4. Введення та виведення елементів масиву
#a = input("Введіть елементи масиву через пробіл: ").split(',')
#print(a)

