# 12.1. Опрацювання спискових величин

# Приклад опрацювання послідовності елементів
#for elem in c:
#    print(elem, end=' ')


# ВПРАВА 1
import math

# створюємо порожній список
a = []

for i in range (5):
# додаємо введені елементи до списку в області виконання проєкту
    a.append(int(input('Введіть елемент списку')))
    # змінюємо елементи списку
    a[i]=a[i]**2
# виводимо результат
print(a)

# ЗАВДАННЯ
# Уявіть, що Ви здійснили 3 покупки товарів із тризначною ціною
#  із застосування 15% промокоду зі знижкою. Скопіюйте та відредагуйте код вище,
# щоб ви побачили ціни на ваші товари із застосованою знижкою.




