# 12.2. Опис програми зміни значення даних списку
import random
# задаємо контрольне значення особистого рекорду
personal_record = int(input('Введіть значення особистого рекорду: '))

#Створюємо порожній список спроб
attempt_list = []

for i in range (10):
    # додаємо введені елементи до списку в області виконання проєкту
    attempt_list.append(random.randint((personal_record - 10), 194))
    # змінюємо елементи списку
    if attempt_list[i] > personal_record:
        attempt_list[i] = 0
# виводимо результат
print(attempt_list)



# ЗАВДАННЯ
# У спортзалі встановили датчик, який фіксує кількість підтягувань учня під час тренування.
# Норматив становить певну кількість підтягувань для кожного класу (напр., 10 для 9-го класу).
# Потрібно:
# Ввести з клавіатури норматив підтягувань.
# Створити список із значеннями підтягувань 12 випадкових учнів у діапазоні:
# 		від (норматив – 5) до (норматив + 4).
# Якщо значення менше за норматив, замінити його на –1 (норматив не виконано).
# Вивести отриманий список на екран.
import random

# Вводимо норматив
norm = int(input('Введіть норматив підтягувань: '))

# Створюємо порожній список
results = []

for i in range(12):
    # Додаємо випадкове значення до списку
    results.append(random.randint(norm - 5, norm + 4))
    
    # Перевіряємо виконання нормативу
    if results[i] < norm:
        results[i] = -1

# Виводимо результат
print(results)