# Ви здійснили замовлення в інтернет магазині. У вашій корзині 
# зараз знаходяться товари, ціни яких відображені в списку
product_list = [12, 25, 65, 52, 120, 85, 54, 207]

# Завдання 1. Знайдіть суму всіх товарів у списку та виведіть її у консоль
# Розв'язування
summ = 0

for i in range (len(product_list)):
    summ = summ + product_list[i]
print("Загальна вартість покупок:", summ)

# Завдання 2. Знайдіть середню ціну за товар у вашій корзині
# Завдання 3. Знайдіть суму елементів, що містяться під парним порядковим номером
# Завдання 4. Знайдіть суму парних чисел списку. Виведіть при цьому в новий список
# парні значення та в окрему змінну - їх суму.