# У шкільній метеостанції ведеться спостереження за температурою
# повітря упродовж дня. Датчики фіксують температуру та надсилають
# для програмного опрацювання у вигляді послідовного списку значень.
# Створіть програму для знаходження кількості отриманих значень,
# які відповідають першому значенню у списку.

import random

spysok_temperatur = []
lichylnyk = 0
kilkist_hodyn = 24

# Створіть цикл, який буде замість датчиків наповнювати
# список значеннями температур



# Створіть ще один цикл, на кожній ітерації якого треба
# виконувати перевірку згідно з умови. Якщо перевірка виконується,
# то лічильник необхідно збільшувати на одиницю
